# 1단계

# Example
"""
OPENAI_API_KEY=''
DEBUG_MODE=''
"""

#2단계

# os.environ의 상태 (아직 .env 파일 내용은 없음)
{
    'PATH': '',
    'USER': '',
    # OPENAI_API_KEY 같은 건 찾아볼 수 없음!
}


#3단계

"""
파이썬이 load_dotenv()를 실행하면 컴퓨터 안에서 다음과 같은 일이 일어납니다.

파일 읽기: 파이썬이 하드디스크에 있는 .env 파일을 오픈해서 텍스트를 읽습니다.

파싱(분석): 이름=값 형태로 되어 있는 줄들을 찾습니다. (OPENAI_API_KEY라는 이름과 sk-proj-...라는 값을 분리)

메모리(환경 변수 공간)에 주입: 파이썬 프로그램이 실행되고 있는 컴퓨터의 RAM(임시 메모리) 공간에 있는 환경 변수 사전(os.environ)에 이 값들을 그대로 등록합니다.

"""



# 4단계

# os.environ의 상태 (이제 .env 내용이 쏙 들어와 있음!)
{
    'PATH': '',
    'USER': '',
    'OPENAI_API_KEY': '',  # <--- 이 부분이 추가됨!
    'DEBUG_MODE': ''                            # <--- 이 부분도 추가됨!
}


